Revit 2027 API
ParameterTypeId.RepeatingDetailRotation Property
 "Detail Rotation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RepeatingDetailRotation { get; }
Public Shared ReadOnly Property RepeatingDetailRotation As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RepeatingDetailRotation {
	ForgeTypeId^ get ();
}
static member RepeatingDetailRotation : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace